app/controllers/instructors_controller.rb

INSERT INTO "instructors" ("name", "user_email", "password_digest", "department", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "i1"], ["user_email", "i@i.com"], ["password_digest", "[FILTERED]"], ["department", "csc"], ["created_at", "2022-02-06 20:54:26.509109"], ["updated_at", "2022-02-06 20:54:26.509109"]]
INSERT INTO "users" ("email", "password_digest", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "c"], ["password_digest", "[FILTERED]"], ["role", "INSTRUCTOR"], ["created_at", "2022-02-06 21:08:00.526230"], ["updated_at", "2022-02-06 21:08:00.526230"]]
---
  def create
    @instructor = Instructor.new(instructor_params)

    respond_to do |format|
      if @instructor.save
        format.html { redirect_to instructor_url(@instructor), notice: "Instructor was successfully created." }
        format.json { render :show, status: :created, location: @instructor }
        @user = User.new
        @user.email = @instructor.user_email
        @user.password_digest = @instructor.password_digest
        @user.role = 'INSTRUCTOR'
        @user.save

SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_instructor
      @instructor = Instructor.find(params[:id])