app/controllers/sessions_controller.rb

  def create
    user = User.find_by_email(params[:user_email])
    if params[:user_email] == "test@gmail.com" && params[:password]== "123456"
      session[:user_email] = "test@gmail.com"
      session[:role]="ADMIN"
      admin = Admin.find_by_user_email(params[:user_email])
      session[:user_name] = admin.name
      session[:id] = admin.id
      redirect_to admin_path admin.id


    elsif user && user.authenticate(params[:password])
      session[:user_email] = user.email
      session[:role]=user.role
      case user.role
      when 'INSTRUCTOR'
        instructor = Instructor.find_by_user_email(params[:user_email])
        session[:user_name] = instructor.name
        session[:id] = instructor.id
        redirect_to instructor_path instructor.id
      when 'STUDENT'
        student = Student.find_by_user_email(params[:user_email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "i@i.com"], ["LIMIT", 1]]
SELECT "instructors".* FROM "instructors" WHERE "instructors"."user_email" = ? LIMIT ?  [["user_email", "i@i.com"], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."user_email" = ? LIMIT ?  [["user_email", "s1"], ["LIMIT", 1]]