app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
        format.html { redirect_to student_url(@student), notice: "Student was successfully created." }
        format.json { render :show, status: :created, location: @student }
        @user = User.new
        @user.email = @student.user_email
        @user.password_digest = @student.password_digest
        @user.role = 'STUDENT'
        @user.save
---
INSERT INTO "students" ("name", "password_digest", "dob", "user_email", "phone", "major", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "users" ("email", "password_digest", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "s1"], ["password_digest", "[FILTERED]"], ["role", "STUDENT"], ["created_at", "2022-02-07 15:11:48.086653"], ["updated_at", "2022-02-07 15:11:48.086653"]]